[
    {
        "case_id": "0",
        "priority": "0",
        "difficulty_level": "0",
        "title": "Retraction and coasting settings",
        "clue_id": "0",
        "clue": "I am using Simplify3D for slicing.",
        "case_content": "Retraction and coasting settings",
        "solution": "It’s possible your retraction settings need to be adjusted slightly. Click on “Edit Process Settings” and go to the Extruders tab. Right below the retraction distance, there is a setting labeled “Extra Restart Distance.” This option determines the difference between the retraction distance when the extruder is stopping and the priming distance that is used when the extruder is restarting. If you notice a surface defect right at the beginning of the perimeter, then your extruder is likely priming too much plastic. You can reduce the priming distance by entering a negative value for the extra restart distance. For example, if your retraction distance is 1.0mm, and the extra restart distance is -0.2mm (note the negative sign), then each time your extruder stops, it will retract 1.0mm of plastic. However, each time the extruder has to start extruding again, it will only push 0.8mm of plastic back into the nozzle. Adjust this setting until the defect no longer appears when the extruder initially begins printing the perimeter.",
        "tutorial_webdoc": "",
        "tutorial_video": "",
        "id_post": ""
    },
    {
        "case_id": "1",
        "priority": "0",
        "difficulty_level": "0",
        "title": "Coasting",
        "clue_id": "1",
        "clue": "The defect does not occur until the end of the perimeter when the extruder is coming to a stop. / I am using Simplify3D for slicing.",
        "case_content": "Turn on coasting",
        "solution": "Coasting will turn off your extruder a short distance before the end of the perimeter to relieve the pressure that is built up within the nozzle. Enable this option and increase the value until you no longer notice a defect appearing at the end of each perimeter when the extruder is coming to a stop. Typically, a coasting distance between 0.2-0.5mm is enough to have a noticeable impact.",
        "tutorial_webdoc": "https://all3dp.com/2/cura-coasting-settings-explained/",
        "tutorial_video": "",
        "id_post": ""
    },
    {
        "case_id": "2",
        "priority": "0",
        "difficulty_level": "0",
        "title": "Avoid unnecessary retractions",
        "clue_id": "0",
        "clue": "I am using Simplify3D for slicing.",
        "case_content": "Avoid unnecessary retractions",
        "solution": "The retraction and coasting settings mentioned above can help avoid defects each time the nozzle retracts, however, in some cases, it is better to simply avoid the retractions all together. This is particularly important for machines that use a Bowden extruder, as the long distance between the extruder motor and the nozzle makes retractions more troublesome. To adjust the settings that control when a retraction takes place, go to the Advanced tab and look for the “Ooze Control Behavior” section. This section contains many useful settings that can modify the behavior of your 3D printer.",
        "tutorial_webdoc": "",
        "tutorial_video": "",
        "id_post": ""
    },
    {
        "case_id": "3",
        "priority": "0",
        "difficulty_level": "0",
        "title": "",
        "clue_id": "0",
        "clue": "I am using Simplify3D for slicing.",
        "case_content": "Avoid unnecessary retractions",
        "solution": "If your printer is only going to retract when crossing open spaces, then it would be beneficial to avoid these open spaces as much as possible. Simplify3D includes an extremely useful feature that can divert the travel path of the extruder to avoid crossing an outline perimeter. If the extruder can avoid crossing the outline by changing the travel path, then a retraction won’t be needed. To use this feature, simply enable the “Avoid crossing outline for travel movement” option.",
        "tutorial_webdoc": "",
        "tutorial_video": "",
        "id_post": ""
    },
    {
        "case_id": "4",
        "priority": "0",
        "difficulty_level": "1",
        "title": "Non-stationary retractions",
        "clue_id": "",
        "clue": "",
        "case_content": "Non-stationary retractions",
        "solution": "First, click “Edit Process Settings” and go to the Extruder tab. Make sure that the “Wipe Nozzle” option is enabled. This will tell the printer to wipe the nozzle at the end of each section when it stops printing. For the “Wipe Distance”, enter a value of 5mm as a good starting point. Next, go to the Advanced tab and enable the option labeled “Perform retraction during wipe movement”. This will prevent a stationary retraction, since the printer has now been instructed to wipe the nozzle while it retracts.",
        "tutorial_webdoc": "",
        "tutorial_video": "",
        "id_post": ""
    },
    {
        "case_id": "5",
        "priority": "0",
        "difficulty_level": "1",
        "title": "Choose the location of your start points",
        "clue_id": "0",
        "clue": "I am using Simplify3D for slicing.",
        "case_content": "",
        "solution": "Click on “Edit Process Settings” and select the Layer tab. In most cases, the locations of these start points are chosen to optimize the printing speed. However, you also have the ability to randomize the placement of the start points or align them to a specific location. For example, if you were printing a statue, you could align all of the start points to be on the backside of the model so that they were not visible from the front. To do this, enable the “Choose start point that is closest to specific location” option and then enter the XY coordinate where you want the start points to be placed.",
        "tutorial_webdoc": "https://all3dp.com/2/cura-z-seam-tutorial/",
        "tutorial_video": "",
        "id_post": ""
    },
    {
        "case_id": "6",
        "priority": "1",
        "difficulty_level": "0",
        "title": "Seam",
        "clue_id": "2, 3",
        "clue": "You have noticed an alignment of bumps down the side of your print, which is called Z seam. /  I am using Cura for slicing.",
        "case_content": "Sharpest corner option is good at hiding it",
        "solution": "In Cura, choose ‘Sharpest Corner’ for Z seam alignment in print settings.",
        "tutorial_webdoc": "https://all3dp.com/2/cura-z-seam-tutorial/",
        "tutorial_video": "",
        "id_post": "k94f0a"
    },
    {
        "case_id": "7",
        "priority": "1",
        "difficulty_level": "0",
        "title": "",
        "clue_id": "2, 3",
        "clue": "You have noticed an alignment of bumps down the side of your print, which is called Z seam. /  I am using Cura for slicing.",
        "case_content": "Different seam setting in Cura",
        "solution": "If you want to have a straight line, set it to ‘user specified’ in Cura’s seam setting.\nIf you want to try to hide the seam use ‘random’.\nAnyway this happens because at the end of the layer and while the printer moves to start next layer it's not moving and the oozing is what makes those bulges, to reduce the size of this bulges you should use the coasting setting which stops extruding filament right before finishing the layer so that the last part is printed with what would ooze so you don't have an excess of material, even with that setting it will still be visible but that's just how 3d printing works.\n",
        "tutorial_webdoc": "https://all3dp.com/2/cura-z-seam-tutorial/",
        "tutorial_video": "https://youtu.be/CUpKUHUeteY",
        "id_post": "ilnb2x"
    },
    {
        "case_id": "8",
        "priority": "1",
        "difficulty_level": "0",
        "title": "",
        "clue_id": "2, 3",
        "clue": "You have noticed an alignment of bumps down the side of your print, which is called Z seam. /  I am using Cura for slicing.",
        "case_content": "Smart Hiding ",
        "solution": "There is a setting in Cura called \"Seam corner preference\". You can choose where it will start a new layer (for example inside a corner). I have it set to \"smart hiding\"",
        "tutorial_webdoc": "https://all3dp.com/2/cura-z-seam-tutorial/",
        "tutorial_video": "",
        "id_post": "lccggs"
    },
    {
        "case_id": "9",
        "priority": "1",
        "difficulty_level": "1",
        "title": "",
        "clue_id": "4",
        "clue": "Blobs and voids happen together.",
        "case_content": "Blobs are a sign of over extrusion. the voids are a sign of under extrusion. The fact that you have both is odd.",
        "solution": "I am guessing that your extruder is getting a micro clog then fixing itself and shooting out the filament under pressure. You could try increasing the hotend temperature or getting a filament filter.",
        "tutorial_webdoc": "",
        "tutorial_video": "",
        "id_post": "nnlnx5"
    },
    {
        "case_id": "10",
        "priority": "1",
        "difficulty_level": "0",
        "title": "Coasting",
        "clue_id": "3",
        "clue": "I am using Cura for slicing.",
        "case_content": "Coasting",
        "solution": "Try using coasting if you are using Cura. It lowers the pressure as it gets to the end of a layer. You may have built up pressure blobbing out at the end of the layer. You can adjust the coasting distance. For something like that I'd start a test print at about .04 coast, if it's still visible, increase by .01, if it's now got divits then decrease by .01",
        "tutorial_webdoc": "https://all3dp.com/2/cura-coasting-settings-explained/",
        "tutorial_video": "",
        "id_post": "ek8u0z, g4wu4d, lccggs"
    },
    {
        "case_id": "11",
        "priority": "1",
        "difficulty_level": "0",
        "title": "Retract at layer change",
        "clue_id": "2, 3",
        "clue": "You have noticed an alignment of bumps down the side of your print, which is called Z seam. /  I am using Cura for slicing.",
        "case_content": "Retract at layer change",
        "solution": "You can change z seam alignment to random, but this will only lead to spread the bumps all over the print. Cause of this problem is extruding while changing the layer. This can be minimized by activating coasting and or retract at layer change. Therefore, try randomizing the z seam, otherwise try sharpest corner with smart hiding on. I also find good success if I turn off \"retract at layer change\" , and \"retract before outer wall\" is off too. I find that if I have those retractions on, it makes the Z seam stand out even more than if it's off.",
        "tutorial_webdoc": "https://community.ultimaker.com/topic/22027-cura-retraction-in-print/",
        "tutorial_video": "",
        "id_post": "jj0dpu"
    },
    {
        "case_id": "12",
        "priority": "1",
        "difficulty_level": "0",
        "title": "Outer wall wipe distance",
        "clue_id": "3",
        "clue": "I am using Cura for slicing.",
        "case_content": "Outer wall wipe distance",
        "solution": "In a wipe setting, reduce or remove wipe nozzle.",
        "tutorial_webdoc": "https://community.ultimaker.com/topic/35891-outer-wall-wipe-distance/",
        "tutorial_video": "",
        "id_post": "ek8u0z, ilnb2x"
    },
    {
        "case_id": "13",
        "priority": "1",
        "difficulty_level": "0",
        "title": "Cura slicer issue",
        "clue_id": "5",
        "clue": "I am using Cura 4.7.x.",
        "case_content": "Cura 4.7 has a bug.",
        "solution": "It might just be a slicer issue with Cura 4.7.x that hasn't been fixed yet. I'd try an older version (4.6.x) or another slicer to rule out the slicer and then focus on slicing parameters",
        "tutorial_webdoc": "https://www.reddit.com/r/FixMyPrint/comments/iq6iyb/psa_theres_a_bug_in_cura_47x/",
        "tutorial_video": "",
        "id_post": "j1xhcp"
    },
    {
        "case_id": "14",
        "priority": "1",
        "difficulty_level": "0",
        "title": "Stuck filament",
        "clue_id": "",
        "clue": "",
        "case_content": "Stuck filament",
        "solution": "Something to check on the simpler side is make sure your filament is not getting snagged and that it is rolling free. If the extruder has to pull it can cause issues like that.",
        "tutorial_webdoc": "",
        "tutorial_video": "",
        "id_post": "my80yp"
    },
    {
        "case_id": "15",
        "priority": "1",
        "difficulty_level": "0",
        "title": "Wet filament",
        "clue_id": "",
        "clue": "",
        "case_content": "Wet filament",
        "solution": "Those bumps could be moisture in the filament. That could also cause poor printing quality as well. If it's not new maybe try drying it. Put it in a dehydrator for a few hours or try a fresh roll of filament instead.",
        "tutorial_webdoc": "https://all3dp.com/2/how-to-dry-filament-pla-abs-and-nylon/",
        "tutorial_video": "",
        "id_post": "o2onze"
    }
]